In [9]:
import pandas as pd

#import csv
city_data = pd.read_csv("City_Updated_JS.csv")
income_data = pd.read_csv("income_updated_JS.csv")
mental_data = pd.read_csv("mental_updated.csv")

In [7]:
city_data.insert(loc=0, column='id', value=city_data.index + 1)
city_data.head()

   id         city state_id  state_name  population  density
0   1     New York       NY    New York    18713220    10715
1   2  Los Angeles       CA  California    12750807     3276
2   3      Chicago       IL    Illinois     8604203     4574
3   4        Miami       FL     Florida     6445545     5019
4   5       Dallas       TX       Texas     5743938     1526

In [11]:
income_data.insert(loc=0, column='id', value=income_data.index + 1)
income_data.head()

   id State_Name State_ab            City     ALand     AWater  Median  Stdev
0   1    Alabama       AL       Chickasaw  10894952     909156   30506  33101
1   2    Alabama       AL      Louisville  26070325      23254   19528  43789
2   3    Alabama       AL      Columbiana  44835274     261034   31930  57348
3   4    Alabama       AL         Satsuma  36878729    2374530   52814  47707
4   5    Alabama       AL  Dauphin Island  16204185  413605152   67225  54270

In [14]:
mental_data.insert(loc=0, column='id', value=mental_data.index + 1)
mental_data.head()

,id,city,State_ab,State_name,Low_Confidence_Limit,Data_Value,High_Confidence_Limit,PopulationCount
0,1,Abilene,TX,Texas,13.741026,15.053846,16.346154,9004.692308
1,2,Akron,OH,Ohio,15.933824,17.227941,18.564706,8784.176471
2,3,Alameda,CA,California,9.211111,10.083333,11.033333,12302.000000
3,4,Albany,GA,Georgia,14.456364,15.961818,17.509091,9561.272727
4,5,Albuquerque,NM,New Mexico,12.920863,14.153237,15.425180,11780.611510

In [19]:
city_data.to_csv("city_update_id_JDLT.csv")
income_data.to_csv("income_update_id_JDLT.csv")
mental_data.to_csv("mental_update_id_JDLT.csv")